app/controllers/api/boards_controller.rb

    def create
      @board = current_user.boards.new(board_params)

      if @board.save
---
INSERT INTO "boards" ("created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 21 Nov 2014 19:43:29 UTC +00:00], ["title", "Meow~!"], ["updated_at", Fri, 21 Nov 2014 19:43:29 UTC +00:00], ["user_id", 3]]

    def show
      @board = Board.includes(:members, lists: :cards).find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", "1"]]