app/controllers/api/cards_controller.rb

INSERT INTO "cards" ("created_at", "description", "list_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
      @card = current_list.cards.new(card_params)
      if @card.save