app/controllers/api/lists_controller.rb

INSERT INTO "lists" ("board_id", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["board_id", 4], ["created_at", Fri, 21 Nov 2014 22:49:08 UTC +00:00], ["title", "First List!!!"], ["updated_at", Fri, 21 Nov 2014 22:49:08 UTC +00:00]]
---
    def create
      @list = current_board.lists.new(list_params)

      if @list.save